'''关于我的AI考研自述
华中科技大学25考研，今年是更换专业课的第一年，所以来说可能确实比往年爆冷，往年的分数线在345，而今年只有315，可能确实也是英语较难导致的。
话入正题，初试占比6，复试占比4，初试的数一英一，专业课数据结构加模式识别，数据结构完全可以看王道的辅导书，绝对是完全覆盖的，
模式识别的范围太过广泛，建议重点看贝叶斯、神经网络参数计算和svm这些，其他会零散地出一些填空题。
复试：先英文介绍两分钟，可以报自己的本科院校，然后参加过哪些竞赛之类，不会的话就说自己的兴趣爱好，
然后是英文提问3分钟，这个只会有一个老师提问，应该不是本专业的，请的外援，他第一个问我做过哪些研究，我报了我的本科毕设题目，
然后问我有没有paper，我说no paper，然后他就问我的研究计划有吗？具体是怎样？之后就结束了。
然后是中文自我介绍5分钟，我主要讲了我的一些课程设计和参加的大创项目，我在大创项目里面提到我用小波变换做了特征提取，
然后那个老师就很详细地提问这个小波变换的原理和我的理解，提问的那个是蔡超，他之前就是教我们数字信号处理的，主要研究方向也是这个。光这个就提问我至少三分钟，
其次，他开始问我模式识别和机器学习的区别，什么是模式识别和机器学习，我举了几个例子给他，像svm、线性分类器和强化学习。
然后问我在进行研究时如何选择用模式识别的办法还是机器学习的办法。
之后问了如果导师给我的研究课题和我的知识储备不相符，你要如何处理，我提了终身学习给他。
最后就是其他老师大概问了一下我项目的具体内容。我感觉提问的随机性很大，完全是根据你的项目来的，可能会针对提问你的论文和内容。
要注重对自己项目的理解，跟面试老师也有关，像蔡超就是研究信号提取的，对小波就比较敏感。
笔试方面：微机原理加c语言，可能往后会改，不确定。首先是15分的微机原理基础知识填空很简单，
然后是一道最小工作时序图，要求画出各个引脚的时序变化和具体工作内容，4个时钟周期都会发生什么，
然后下一道是中断向量的设置和取出，第八章的内容，学会写这方面的汇编代码。然后是一道字拓展和位拓展电路设计题，很简单的连线图。两个32kb拓展成64kb，全译码方式。
c语言第一道是填空题，把一个字符串中每个数字出现的频率从低到高排序，里面有个冒泡排序的4个空，两个嵌套循环。
第二道是程序输出题，主要是明白常用符号的运算顺序。像自增、自减，三目运算符之类的。
然后是两道编程题，第一道是输入很多字符串，去掉每个字符串中除字符串第一个位置是%的其他%。
第二个是输入一个字符串英文句子，每个单词应该是用‘ ’隔开，找出其中最长的单词，如果是同样长度就都返回。
大概就是这样，其实可以刷一下力口的中等题和简单题就够了。
总体来说应该没有院校歧视，本校本院分数比我高的，也有被刷掉的，复试不好好准备很容易被反。'''